# GetMaximumAllowedWidth Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextElement..::..GetMaximumAllowedWidth Method
TextElement Class See Also
---
Returns the maximum width the text element can be assigned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double GetMaximumAllowedWidth()
```

Visual Basic
---
```text
Public Function GetMaximumAllowedWidth As Double
```

Visual C++
---
```text
public:
double GetMaximumAllowedWidth()
```

# ### Return Value
The maximum allowed width in paper space [ft].
# Remarks
Note that it is not necessarily a constant; it can be affected by properties of the text and its type, such as the width factor.
# See Also
TextElement Class
GetMaximumAllowedWidth Overload
Autodesk.Revit.DB Namespace